huaweiwx/sduino/sduino/hardware/sduino/stm8/system/stm8chips/stm8_pinNum.h
//huaweiwx@sina.com 2018.4.08
#ifndef _STM8PINSNUM_H_
#define _STM8PINSNUM_H_

//A
#define  _PA0  0
#define  _PA1  1
#define  _PA2  2
#define  _PA3  3
#define  _PA4  4
#define  _PA5  5
#define  _PA6  6
#define  _PA7  7

//B
#define  _PB0  8
#define  _PB1  9
#define  _PB2  10
#define  _PB3  11
#define  _PB4  12
#define  _PB5  13
#define  _PB6  14
#define  _PB7  15

//C
#define  _PC0  16
#define  _PC1  17
#define  _PC2  18
#define  _PC3  19
#define  _PC4  20
#define  _PC5  21
#define  _PC6  22
#define  _PC7  23

//D
#define  _PD0  24
#define  _PD1  25
#define  _PD2  26
#define  _PD3  27
#define  _PD4  28
#define  _PD5  29
#define  _PD6  30
#define  _PD7  31

//E
#define  _PE0  32
#define  _PE1  33
#define  _PE2  34
#define  _PE3  35
#define  _PE4  36
#define  _PE5  37
#define  _PE6  38
#define  _PE7  39

//F
#define  _PF0  40
#define  _PF1  41
#define  _PF2  42
#define  _PF3  43
#define  _PF4  44
#define  _PF5  45
#define  _PF6  46
#define  _PF7  47

//G
#define  _PG0  48
#define  _PG1  49
#define  _PG2  50
#define  _PG3  51
#define  _PG4  52
#define  _PG5  53
#define  _PG6  54
#define  _PG7  55

//H
#define  _PH0  56
#define  _PH1  57
#define  _PH2  58
#define  _PH3  59
#define  _PH4  60
#define  _PH5  61
#define  _PH6  62
#define  _PH7  63

//I
#define  _PI0  64
#define  _PI1  65
#define  _PI2  66
#define  _PI3  67
#define  _PI4  68
#define  _PI5  69
#define  _PI6  70
#define  _PI7  71

#endif //_STM8PINSNUM_H_

